In [16]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import StandardScaler

df = pd.read_csv("../../data/Salary_Data.csv")
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [17]:
df.columns = df.columns.str.strip()

In [ ]:
print(" Data Information:")
print(df.info())
print("\n Missing Values:\n", df.isnull().sum())
print("\n Sample Data:\n", df.head())

ðŸ”¹ Initial Data Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB
None

ðŸ”¹ Missing Values:
 Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

ðŸ”¹ Sample Data:
     Age  Gender Education Level          Job Title  Years of Experience  \
0  32.0    Male      Bachelor's  Software Engineer                  5.0
1  28.0  Female        Master's       Data Analyst                  3.0
2  45.0    Male             PhD     Senior Manager                 15.0
3  36.0  Female      Bachelor's    Sales Associate                  7.0
4  52.0    Male        Master's           Director                 20.0

     Salary
0   90000.0
1   65000.0
2  150000.0
3   60000.0
4  200000.0

In [19]:
df = df.drop_duplicates()

In [20]:
df['Age'] = df['Age'].fillna(df['Age'].median())
df['Years of Experience'] = df['Years of Experience'].fillna(df['Years of Experience'].median())

In [22]:
df = df.dropna(subset=['Salary'])

In [23]:
categorical_cols = ['Gender', 'Education Level', 'Job Title']
for col in categorical_cols:
    df[col] = df[col].fillna('Unknown')

In [25]:
print("\nCleaned Data :")
print(df.info())
print("\n Checking Null :\n", df.isnull().sum())
print("\nPreview:\n", df.head())

Cleaned Data :
<class 'pandas.core.frame.DataFrame'>
Index: 1788 entries, 0 to 6631
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  1788 non-null   float64
 1   Gender               1788 non-null   object
 2   Education Level      1788 non-null   object
 3   Job Title            1788 non-null   object
 4   Years of Experience  1788 non-null   float64
 5   Salary               1788 non-null   float64
dtypes: float64(3), object(3)
memory usage: 97.8+ KB
None

 Checking Null :
 Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

Preview:
     Age  Gender Education Level          Job Title  Years of Experience  \
0  32.0    Male      Bachelor's  Software Engineer                  5.0
1  28.0  Female        Master's       Data Analyst                  3.0
2  45.0    Male             PhD     Senior Manager                 15.0
3  36.0  Female      Bachelor's    Sales Associate                  7.0
4  52.0    Male        Master's           Director                 20.0

     Salary
0   90000.0
1   65000.0
2  150000.0
3   60000.0
4  200000.0